document.addEventListener('DOMContentLoaded', () => {

    const Button = document.getElementById('MessageButton');
    const Wrong = document.getElementById('MessageWrong');
    const BadWords = ["пизда", "пизду", "пиздае", "пизды", "пиздуй", "пиздить", "пиздюля",
    "хуёво", "хуёвы", "хуй", "хуйка", "хуйло", "хую", "хуйня", "хуй в рот",
    "хуй в руку", "хуй соси", "хуище", "хуевый", "хуёвый", "хуёчий",
    "гандон", "тварь", "придурок", "долбоеб", "ебать", "ебало", "ебаный",
    "ебучий", "блядь", "бля", "блядина", "сука", "сукина дочь", "манда",
    "мандавошка", "пидор", "пидорас", "пидр", "шлюха", "шлюшка", "жопа",
    "жопу", "задница", "уебок", "уебища", "мудень", "мудила", "лох",
    "лохматый", "пидорас", "пидар", "хер", "херня", "дрочить", "дрочка",
    "трахать", "трахнуться", "насрать", "насрёт", "на хую", "на хую я буду",
    "нахуй", "нахуй тебе", "на хую держи", "ебать", "ебучий", "ебать концы",
    "похуй", "похуист", "поганый", "поганец", "жопа", "позор", "скотина",
    "мразь", "чмо", "кретин", "идиот", "дурак", "мудак", "тварь",
    "подонок", "скот", "ублюдок", "жлоб", "отстоя", "шакал", "похабный",
    "заводила", "дебил", "тупой", "имбицил", "валенок", "засранец", "халдей",
    "гавно", "говнище", "говнюк", "мандавошка", "шлюха ебаная", "срака", 
    "сраный", "засранец", "сучара", "скотина", "жопошник", "подонок", "жадина",
    "мразь", "засранец", "черт", "бес", "злодей", "злобный", "подлый",
    "проходимец", "отморозок", "преступник", "наркоман", "алкоголик",
    "тварь поганая", "дура", "козел", "предатель", "враг", "разбойник",
    "оскорбление", "мразота", "обоссаный", "засранец", "шайка", "шакал",
    "халтурщик", "отстой", "фуфло", "фигня", "ерунда", "чушь", "бред",
    "маразм", "идиотизм", "дурость", "глупость", "тупость", "сумасшедший",
    "бесполезный", "бестолковый", "бестолочь", "придурок", "тварь",]
    
    function TestBadWords(text) {
        const lowerText = text.toLowerCase();
        return BadWords.some(word => lowerText.includes(word));
    }
function Sent () {
    const MessageText = document.getElementById('MessagePool').value;
    if (MessageText.trim() === '') {
            Wrong.style.display = 'block';
            Wrong.innerHTML = '*Сообщение не может быть пустым';
    }
    else {
        if (TestBadWords(MessageText)) {
            Wrong.style.display = 'block';
            Wrong.innerHTML = '*Сообщение содержит запрещенные слова';
        }
    else {
        Wrong.style.display = 'none';
    }
}
}
Button.addEventListener('click', Sent)
}); 